       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CLIENTES.
       AUTHOR.        "Hernande Monteiro".
      * Este programa exibe uma mensagem de saudação.
       ENVIRONMENT    DIVISION.
       DATA           DIVISION.
       PROCEDURE      DIVISION.
           DISPLAY "CLIENTES!".
           STOP RUN.
