       IDENTIFICATION        DIVISION.
       PROGRAM-ID. OLACOBOL.
       PROCEDURE             DIVISION.
           DISPLAY "OLA MUNDO!".
           STOP  RUN.
      